In [1]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "name":['pooja', 'priya', 'poonam', 'nayan'],
    "age":[22,19,17,13],
    "city":['vikhroli','mulund','ulhasnagar','thane']
}

In [5]:
df = pd.DataFrame(dict1)

In [6]:
df

     name  age        city
0   pooja   22    vikhroli
1   priya   19      mulund
2  poonam   17  ulhasnagar
3   nayan   13       thane

In [7]:
df.to_csv('friends.csv')

In [8]:
df.to_csv('friends_no_index.csv', index = False)

In [9]:
df.head(2)

    name  age      city
0  pooja   22  vikhroli
1  priya   19    mulund

In [10]:
df.tail(2)

     name  age        city
2  poonam   17  ulhasnagar
3   nayan   13       thane

In [12]:
df.describe()

             age
count   4.000000
mean   17.750000
std     3.774917
min    13.000000
25%    16.000000
50%    18.000000
75%    19.750000
max    22.000000

In [13]:
friends = pd.read_csv('friends_no_index.csv')

In [14]:
friends

     name  age        city
0   pooja   22    vikhroli
1   priya   19      mulund
2  poonam   17  ulhasnagar
3   nayan   13       thane

In [15]:
friends['age'][0]

np.int64(22)

In [16]:
friends['age'][0] = 21

C:\Users\Pooja Nayak\AppData\Local\Temp\ipykernel_4640\3240121025.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  friends['age'][0] = 21
C:\Users\Pooja Nayak\AppData\Local\Temp\ipykernel_4640\3240121025.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  friends['age'][0] = 21

In [17]:
friends

     name  age        city
0   pooja   21    vikhroli
1   priya   19      mulund
2  poonam   17  ulhasnagar
3   nayan   13       thane

In [18]:
friends.index = ['first', 'second', 'third', 'fourth']

In [19]:
friends

          name  age        city
first    pooja   21    vikhroli
second   priya   19      mulund
third   poonam   17  ulhasnagar
fourth   nayan   13       thane

In [22]:
ser = pd.Series(np.random.rand(5))

In [23]:
ser

0    0.577722
1    0.856971
2    0.207284
3    0.497094
4    0.677986
dtype: float64

In [24]:
type(ser)

pandas.core.series.Series

In [31]:
newdf = pd.DataFrame(np.random.rand(334,5), index = np.arange(334))
newdf.head()

          0         1         2         3         4
0  0.045178  0.241953  0.403667  0.936204  0.485370
1  0.900845  0.600563  0.052121  0.684036  0.702272
2  0.561677  0.008396  0.482141  0.917929  0.913979
3  0.156596  0.117219  0.107884  0.917898  0.969533
4  0.885940  0.301492  0.285615  0.758537  0.650807

In [28]:
type(newdf)

pandas.core.frame.DataFrame

In [29]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.493872    0.496398    0.545495    0.536132    0.509246
std      0.293056    0.282756    0.286300    0.286017    0.294386
min      0.004588    0.003548    0.009898    0.000305    0.000201
25%      0.215425    0.248958    0.324070    0.299258    0.245775
50%      0.480361    0.517893    0.558827    0.534452    0.542569
75%      0.765242    0.733901    0.797118    0.799557    0.745191
max      0.988120    0.992418    0.998202    0.996354    0.999674

In [30]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [33]:
newdf[0][0] = "pooja"
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [34]:
newdf.head()

          0         1         2         3         4
0     pooja  0.241953  0.403667  0.936204  0.485370
1  0.900845  0.600563  0.052121  0.684036  0.702272
2  0.561677  0.008396  0.482141  0.917929  0.913979
3  0.156596  0.117219  0.107884  0.917898  0.969533
4   0.88594  0.301492  0.285615  0.758537  0.650807

In [35]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [36]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [37]:
newdf.to_numpy()

array([['pooja', 0.24195270854415418, 0.403666990322726,
        0.9362040905951435, 0.4853702748370098],
       [0.9008454047399199, 0.6005633692384426, 0.052120771995272985,
        0.6840361695617772, 0.7022724227977453],
       [0.5616767502681913, 0.008395981481421622, 0.48214082165711636,
        0.9179287785737561, 0.9139786646614546],
       ...,
       [0.9110102298926938, 0.4538244037522263, 0.4020700733724296,
        0.26049550750596495, 0.46456520857869],
       [0.5583024378928559, 0.698844583276529, 0.2243679985424909,
        0.6350332489832252, 0.724097387727218],
       [0.04485759732156969, 0.9062406260561398, 0.08045715801381137,
        0.3754892259325958, 0.9686672422477381]],
      shape=(334, 5), dtype=object)

In [40]:
newdf[0][0] = 0.3
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [41]:
newdf.head()

          0         1         2         3         4
0       0.3  0.241953  0.403667  0.936204  0.485370
1  0.900845  0.600563  0.052121  0.684036  0.702272
2  0.561677  0.008396  0.482141  0.917929  0.913979
3  0.156596  0.117219  0.107884  0.917898  0.969533
4   0.88594  0.301492  0.285615  0.758537  0.650807

In [42]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.900845,0.561677,0.156596,0.88594,0.597218,0.273773,0.612576,0.20181,0.695985,...,0.725517,0.057749,0.888013,0.885475,0.288398,0.466023,0.195024,0.91101,0.558302,0.044858
1,0.241953,0.600563,0.008396,0.117219,0.301492,0.410466,0.18898,0.532259,0.047874,0.263824,...,0.925593,0.579895,0.205214,0.297572,0.352526,0.80203,0.558267,0.453824,0.698845,0.906241
2,0.403667,0.052121,0.482141,0.107884,0.285615,0.257537,0.739619,0.818054,0.42028,0.268031,...,0.711085,0.33739,0.757631,0.163243,0.577596,0.598902,0.610379,0.40207,0.224368,0.080457
3,0.936204,0.684036,0.917929,0.917898,0.758537,0.886886,0.832432,0.192438,0.565714,0.036308,...,0.061833,0.872461,0.293024,0.54216,0.355314,0.325702,0.475363,0.260496,0.635033,0.375489
4,0.48537,0.702272,0.913979,0.969533,0.650807,0.975466,0.317365,0.829121,0.69598,0.701471,...,0.677822,0.873134,0.065242,0.615914,0.780401,0.428217,0.363586,0.464565,0.724097,0.968667

In [44]:
# axis=0 : row
# axis=1 : column

newdf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.485370  0.936204  0.403667  0.241953       0.3
1    0.702272  0.684036  0.052121  0.600563  0.900845
2    0.913979  0.917929  0.482141  0.008396  0.561677
3    0.969533  0.917898  0.107884  0.117219  0.156596
4    0.650807  0.758537  0.285615  0.301492   0.88594
..        ...       ...       ...       ...       ...
329  0.428217  0.325702  0.598902  0.802030  0.466023
330  0.363586  0.475363  0.610379  0.558267  0.195024
331  0.464565  0.260496  0.402070  0.453824   0.91101
332  0.724097  0.635033  0.224368  0.698845  0.558302
333  0.968667  0.375489  0.080457  0.906241  0.044858

[334 rows x 5 columns]

In [46]:
type(newdf[0])

pandas.core.series.Series

In [47]:
#this is view of newdf, so if i make changes in one then another one will change automaticallly
newdf2 = newdf

In [48]:
newdf2[0][0]=9876

In [49]:
newdf

            0         1         2         3         4
0        9876  0.241953  0.403667  0.936204  0.485370
1    0.900845  0.600563  0.052121  0.684036  0.702272
2    0.561677  0.008396  0.482141  0.917929  0.913979
3    0.156596  0.117219  0.107884  0.917898  0.969533
4     0.88594  0.301492  0.285615  0.758537  0.650807
..        ...       ...       ...       ...       ...
329  0.466023  0.802030  0.598902  0.325702  0.428217
330  0.195024  0.558267  0.610379  0.475363  0.363586
331   0.91101  0.453824  0.402070  0.260496  0.464565
332  0.558302  0.698845  0.224368  0.635033  0.724097
333  0.044858  0.906241  0.080457  0.375489  0.968667

[334 rows x 5 columns]

In [50]:
newdf2 = newdf.copy() # this will not keep the changes one

In [51]:
#view ya copy pandas will change itself acc so to prevent that we use loc
newdf.loc[0,0] = 654

In [52]:
newdf.head(2)

          0         1         2         3         4
0       654  0.241953  0.403667  0.936204  0.485370
1  0.900845  0.600563  0.052121  0.684036  0.702272

In [53]:
newdf.columns = list("ABCDE")

In [55]:
newdf.head(2)

          A         B         C         D         E
0       654  0.241953  0.403667  0.936204  0.485370
1  0.900845  0.600563  0.052121  0.684036  0.702272